In [1]:
import pandas as pd
import numpy as np
import openpyxl

Importing a dataset where all the information is in one column.

Made the header = none since row 0 was the header originally.

In [2]:
data = pd.read_excel('data_5.xlsx', header=None)
data

                                                   0
0  Name Hussein Hakeem Address Number 22 Fioye Cr...
1  Name Arojoye Samuel Address 11 Omolade Close O...
2  Name Alex Ezurum Address 1 Adamu Lane, Abuja A...
3  Name Susan Nwaimo Address Number 58 Yaba Stree...
4  Name Ajao Opeyemi Address No12 Olubunmi Street...
5  Name Banjoko Adebusola Address 34 Ngige Street...
6  Name Muhammed Olabisi Address 13, ICAN road, E...
7  Name Oluwagbemi Mojisola Address ACCA Lane, On...

Called the blank column 'column' for now so I can easily grab it.

In [3]:
data.columns = ['column']
data

                                              column
0  Name Hussein Hakeem Address Number 22 Fioye Cr...
1  Name Arojoye Samuel Address 11 Omolade Close O...
2  Name Alex Ezurum Address 1 Adamu Lane, Abuja A...
3  Name Susan Nwaimo Address Number 58 Yaba Stree...
4  Name Ajao Opeyemi Address No12 Olubunmi Street...
5  Name Banjoko Adebusola Address 34 Ngige Street...
6  Name Muhammed Olabisi Address 13, ICAN road, E...
7  Name Oluwagbemi Mojisola Address ACCA Lane, On...

Extracting the string that is between 'Name ' and ' Adress' from 'column' to get the name and putting it in its own column called 'Name'.

In [4]:
data['Name'] = data['column'].str.extract('Name ([^/]+) Address')
data

                                              column                 Name
0  Name Hussein Hakeem Address Number 22 Fioye Cr...       Hussein Hakeem
1  Name Arojoye Samuel Address 11 Omolade Close O...       Arojoye Samuel
2  Name Alex Ezurum Address 1 Adamu Lane, Abuja A...          Alex Ezurum
3  Name Susan Nwaimo Address Number 58 Yaba Stree...         Susan Nwaimo
4  Name Ajao Opeyemi Address No12 Olubunmi Street...         Ajao Opeyemi
5  Name Banjoko Adebusola Address 34 Ngige Street...    Banjoko Adebusola
6  Name Muhammed Olabisi Address 13, ICAN road, E...     Muhammed Olabisi
7  Name Oluwagbemi Mojisola Address ACCA Lane, On...  Oluwagbemi Mojisola

Doing the same procedure for address, age, and gender.

In [5]:
data['Address'] = data['column'].str.extract('Address ([^/]+) Age')
data

,column,Name,Address
0,Name Hussein Hakeem Address Number 22 Fioye Cr...,Hussein Hakeem,Number 22 Fioye Crescent Surulere Lagos
1,Name Arojoye Samuel Address 11 Omolade Close O...,Arojoye Samuel,11 Omolade Close Omole Estate Lagos
2,"Name Alex Ezurum Address 1 Adamu Lane, Abuja A...",Alex Ezurum,"1 Adamu Lane, Abuja"
3,Name Susan Nwaimo Address Number 58 Yaba Stree...,Susan Nwaimo,"Number 58 Yaba Street, Kaduna State"
4,Name Ajao Opeyemi Address No12 Olubunmi Street...,Ajao Opeyemi,"No12 Olubunmi Street, Abeokuta"
5,Name Banjoko Adebusola Address 34 Ngige Street...,Banjoko Adebusola,"34 Ngige Street, Ugheli, Delta"
6,"Name Muhammed Olabisi Address 13, ICAN road, E...",Muhammed Olabisi,"13, ICAN road, Enugu"
7,"Name Oluwagbemi Mojisola Address ACCA Lane, On...",Oluwagbemi Mojisola,"ACCA Lane, Onitsha"

In [6]:
data['Age'] = data['column'].str.extract('Age ([^/]+) Gender')
data

,column,Name,Address,Age
0,Name Hussein Hakeem Address Number 22 Fioye Cr...,Hussein Hakeem,Number 22 Fioye Crescent Surulere Lagos,17
1,Name Arojoye Samuel Address 11 Omolade Close O...,Arojoye Samuel,11 Omolade Close Omole Estate Lagos,16
2,"Name Alex Ezurum Address 1 Adamu Lane, Abuja A...",Alex Ezurum,"1 Adamu Lane, Abuja",14
3,Name Susan Nwaimo Address Number 58 Yaba Stree...,Susan Nwaimo,"Number 58 Yaba Street, Kaduna State",16
4,Name Ajao Opeyemi Address No12 Olubunmi Street...,Ajao Opeyemi,"No12 Olubunmi Street, Abeokuta",18
5,Name Banjoko Adebusola Address 34 Ngige Street...,Banjoko Adebusola,"34 Ngige Street, Ugheli, Delta",14
6,"Name Muhammed Olabisi Address 13, ICAN road, E...",Muhammed Olabisi,"13, ICAN road, Enugu",12
7,"Name Oluwagbemi Mojisola Address ACCA Lane, On...",Oluwagbemi Mojisola,"ACCA Lane, Onitsha",13

In [7]:
data['Gender'] = data['column'].str.extract('Gender ([^/]+)')
data

,column,Name,Address,Age,Gender
0,Name Hussein Hakeem Address Number 22 Fioye Cr...,Hussein Hakeem,Number 22 Fioye Crescent Surulere Lagos,17,Male
1,Name Arojoye Samuel Address 11 Omolade Close O...,Arojoye Samuel,11 Omolade Close Omole Estate Lagos,16,Male
2,"Name Alex Ezurum Address 1 Adamu Lane, Abuja A...",Alex Ezurum,"1 Adamu Lane, Abuja",14,Male
3,Name Susan Nwaimo Address Number 58 Yaba Stree...,Susan Nwaimo,"Number 58 Yaba Street, Kaduna State",16,Female
4,Name Ajao Opeyemi Address No12 Olubunmi Street...,Ajao Opeyemi,"No12 Olubunmi Street, Abeokuta",18,Female
5,Name Banjoko Adebusola Address 34 Ngige Street...,Banjoko Adebusola,"34 Ngige Street, Ugheli, Delta",14,Female
6,"Name Muhammed Olabisi Address 13, ICAN road, E...",Muhammed Olabisi,"13, ICAN road, Enugu",12,Female
7,"Name Oluwagbemi Mojisola Address ACCA Lane, On...",Oluwagbemi Mojisola,"ACCA Lane, Onitsha",13,Female

Dropping the 'column' column as it is not needed anymore.

In [8]:
data.drop('column', axis = 1, inplace = True)

Setting the index to 'Name'.

In [9]:
data.set_index('Name', inplace = True)

In [10]:
data

                                                     Address Age  Gender
Name
Hussein Hakeem       Number 22 Fioye Crescent Surulere Lagos  17    Male
Arojoye Samuel           11 Omolade Close Omole Estate Lagos  16    Male
Alex Ezurum                              1 Adamu Lane, Abuja  14    Male
Susan Nwaimo            Number 58 Yaba Street, Kaduna State   16  Female
Ajao Opeyemi                  No12 Olubunmi Street, Abeokuta  18  Female
Banjoko Adebusola             34 Ngige Street, Ugheli, Delta  14  Female
Muhammed Olabisi                        13, ICAN road, Enugu  12  Female
Oluwagbemi Mojisola                       ACCA Lane, Onitsha  13  Female

Checking the data types of the different columns.

In [11]:
data.dtypes

Address    object
Age        object
Gender     object
dtype: object

Saw that 'Age' was an object so I just changed to an int.

In [12]:
data['Age'] = pd.to_numeric(data['Age'])

In [13]:
data.dtypes

Address    object
Age         int64
Gender     object
dtype: object

Exporting the dataset into an excel file.

In [118]:
with pd.ExcelWriter('clean data.xlsx') as excel_writer:
    data.to_excel(excel_writer, sheet_name='Sheet1', index = True)